app/Controllers/ConDeps.php

SELECT *
FROM `departamentos`
---
    public function verDeps()
    {

        $departamentos = new DepartamentoModel();
        $datos['datos'] = $departamentos->findAll();