app/Controllers/ConNivelesAcademicos.php

SELECT *
FROM `nivelesacademicos`
---
    public function index(): string
    {
        $nivelesAcademicos = new NivelesAcademicosModel();
        $datos['datos'] = $nivelesAcademicos->findAll();