app/Controllers/ConRegiones.php

SELECT *
FROM `regiones`
---
    public function verRegiones(){

        $regiones = new RegionesModel();
        $datos['datos'] = $regiones->findAll();